others/docker-next-ruby-crud/backend/app/controllers/api/v1/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at") VALUES ($1, $2, $3, $4) RETURNING "id", "created_at"  [["name", "nh"], ["description", "hgjghjhg"], ["price", "77.0"], ["created_at", "2026-07-26 10:24:46.520776"]]
---
      def create
        @product = Product.new(product_params)
        if @product.save